In [23]:
from crawl_data import *
import pandas as pd
from datetime import date
import pytz
from ultils import (
    camel_to_snake,
    unix_to_datetime_with_timezone,
    convert_numeric_nan_to_none,
)
from data_warehouse import insert_dataframe_to_sql

## 1. Dữ liệu danh sách các quỹ mở đang có

In [24]:
df_funds = get_all_funds()
df_funds.head(2)

,id,name,shortName,code,price,nav,lastYearNav,holdingVolume,firstIssueAt,approveAt,description,createAt,updateAt,owner,status,dataFundAssetType,productNavChange
0,68,QUỸ ĐẦU TƯ CỔ PHIẾU KINH TẾ HIỆN ĐẠI VINACAPITAL,VMEEF,VMPF,10000.0,14945.25,11250.56,8554587.13,1681146000000,1698976912410,Quỹ VMEEF được đầu tư chủ yếu vào các cổ phiếu...,1698976594493,1723625818886,"{'id': 677, 'encodeURL': 'cong-ty-co-phan-quan...",PRODUCT_ACTIVE,"{'id': 1, 'name': 'Quỹ cổ phiếu', 'code': 'STO...","{'navToPrevious': 0.23, 'navToLastYear': 32.84..."
1,11,QUỸ ĐẦU TƯ LỢI THẾ CẠNH TRANH BỀN VỮNG SSI,SSISCA,SSISCA,10000.0,39648.93,30573.98,3064435.58,1411664400000,1566827410082,Quỹ tăng trưởng NAV thông qua việc chủ động và...,1566826497938,1723626286873,"{'id': 606, 'encodeURL': 'cong-ty-tnhh-quan-ly...",PRODUCT_ACTIVE,"{'id': 1, 'name': 'Quỹ cổ phiếu', 'code': 'STO...","{'navToPrevious': 0.11, 'navToLastYear': 29.68..."

In [25]:
# get list of funds and list of owner
list_fund_id = list(df_funds.id)
list_owner = list(df_funds.owner.drop_duplicates())
print(
    "Number of funds: {}, number of owners: {}".format(
        len(list_fund_id), len(list_owner)
    )
)

Number of funds: 50, number of owners: 22

In [26]:
# convert from unix to datetime
list_datetime_col = ["firstIssueAt", "approveAt", "updateAt", "createAt"]
for col in list_datetime_col:
    df_funds[col] = df_funds[col].apply(lambda x: unix_to_datetime_with_timezone(x))


# add owner_id
df_funds["owner_id"] = df_funds["owner"].apply(lambda x: x["id"])

# add fund type and code
df_funds["fund_type_name"] = df_funds["dataFundAssetType"].apply(lambda x: x["name"])
df_funds["fund_type_code"] = df_funds["dataFundAssetType"].apply(lambda x: x["code"])

# add fund nav changes
list_nav = [
    "navToPrevious",
    "navToLastYear",
    "navToEstablish",
    "navTo1Months",
    "navTo3Months",
    "navTo6Months",
    "navTo12Months",
    "navTo24Months",
    "navTo36Months",
    "navTo60Months",
    "annualizedReturn36Months",
    "navToBeginning",
]
for nav in list_nav:
    df_funds[nav] = df_funds["productNavChange"].apply(lambda x: x[nav])


# rename column cammel format to snake
df_funds.columns = [camel_to_snake(col) for col in df_funds.columns]


# # handle missing or NaN value
df_funds = convert_numeric_nan_to_none(df_funds)

df_funds = df_funds.drop(["data_fund_asset_type", "owner", "product_nav_change"], axis=1)

In [28]:
# insert data to funds table
insert_dataframe_to_sql("funds", df_funds)

Connecting to SQL Server database....
connection successful.
Data inserted into funds successfully.

## 2. Danh sách các Tổ chức phát hành (owner)

In [ ]:
df_owner = pd.DataFrame(list_owner)
df_owner.columns = [camel_to_snake(col) for col in df_owner.columns]

# handle missing or NaN value
df_owner = df_owner.where(pd.notnull(df_owner), None)

df_owner = df_owner[
    [
        "id",
        "encode_url",
        "code",
        "name",
        "email",
        "short_name",
        "address1",
        "website",
        "phone",
    ]
]

# handle missing or NaN value
df_owner = convert_numeric_nan_to_none(df_owner)

df_owner.head(2)

In [ ]:
# insert data to funds table
insert_dataframe_to_sql("owners", df_owner)

## 3. Danh sách top nắm giữ theo mã cổ phiếu/trái phiếu

In [ ]:
top_holding = []
for fund_id in list_fund_id:
    top_holding.append(get_top_holding(fund_id))

# flatten list top hoding
top_holding = [stock_code for fund in top_holding for stock_code in fund]

In [ ]:
df_top_holding = pd.DataFrame(top_holding)

df_top_holding["updateAt"] = df_top_holding["updateAt"].apply(
    lambda x: unix_to_datetime_with_timezone(x)
)

# rename column cammel format to snake
df_top_holding.columns = [camel_to_snake(col) for col in df_top_holding.columns]

df_top_holding = df_top_holding[
    [
        "id",
        "fund_id",
        "stock_code",
        "price",
        "change_from_previous",
        "change_from_previous_percent",
        "industry",
        "type",
        "net_asset_percent",
        "update_at",
    ]
]

# handle missing or NaN value
df_top_holding = convert_numeric_nan_to_none(df_top_holding)

df_top_holding.head()

In [ ]:
# insert data to funds table
insert_dataframe_to_sql("top_stock_holdings", df_top_holding)

## 4. Danh sách top nắm giữ theo loại tài sản

In [5]:
top_asset = []
for fund_id in list_fund_id:
    top_asset.append(get_asset_hoding(fund_id))

# flatten list top hoding
top_asset = [asset_code for asset in top_asset for asset_code in asset]

'NoneType' object is not iterable
'NoneType' object is not iterable

In [8]:
df_top_asset = pd.DataFrame(top_asset)

df_top_asset["updateAt"] = df_top_asset["updateAt"].apply(
    lambda x: unix_to_datetime_with_timezone(x)
)

df_top_asset["createAt"] = df_top_asset["createAt"].apply(
    lambda x: unix_to_datetime_with_timezone(x)
)

# rename column cammel format to snake
df_top_asset.columns = [camel_to_snake(col) for col in df_top_asset.columns]

df_top_asset.head()

,id,asset_type,asset_percent,create_at,update_at,fund_id
0,1993,"{'id': 1, 'code': 'STOCK', 'name': 'Cổ phiếu',...",95.38,2024-08-08 06:00:16.519000+07:00,2024-08-08 06:00:16.519000+07:00,68
1,1994,"{'id': 3, 'code': 'CASH', 'name': 'Tiền và tươ...",4.62,2024-08-08 06:00:16.519000+07:00,2024-08-08 06:00:16.519000+07:00,68
2,2016,"{'id': 1, 'code': 'STOCK', 'name': 'Cổ phiếu',...",90.76,2024-08-08 06:00:25.101000+07:00,2024-08-08 06:00:25.101000+07:00,11
3,2017,"{'id': 3, 'code': 'CASH', 'name': 'Tiền và tươ...",9.24,2024-08-08 06:00:25.101000+07:00,2024-08-08 06:00:25.101000+07:00,11
4,2011,"{'id': 1, 'code': 'STOCK', 'name': 'Cổ phiếu',...",90.73,2024-08-08 06:00:23.885000+07:00,2024-08-08 06:00:23.885000+07:00,14

In [9]:
df_top_asset["asset_name"] = df_top_asset["asset_type"].apply(lambda x: x["name"])
df_top_asset["asset_type"] = df_top_asset["asset_type"].apply(lambda x: x["code"])

df_top_asset = df_top_asset[
    [
        "id",
        "fund_id",
        "asset_type",
        "asset_name",
        "asset_percent",
        "create_at",
        "update_at",
    ]
]

# handle missing or NaN value
df_top_asset = convert_numeric_nan_to_none(df_top_asset)

df_top_asset.head()

,id,fund_id,asset_type,asset_name,asset_percent,create_at,update_at
0,1993,68,STOCK,Cổ phiếu,95.38,2024-08-08 06:00:16.519000+07:00,2024-08-08 06:00:16.519000+07:00
1,1994,68,CASH,Tiền và tương đương tiền,4.62,2024-08-08 06:00:16.519000+07:00,2024-08-08 06:00:16.519000+07:00
2,2016,11,STOCK,Cổ phiếu,90.76,2024-08-08 06:00:25.101000+07:00,2024-08-08 06:00:25.101000+07:00
3,2017,11,CASH,Tiền và tương đương tiền,9.24,2024-08-08 06:00:25.101000+07:00,2024-08-08 06:00:25.101000+07:00
4,2011,14,STOCK,Cổ phiếu,90.73,2024-08-08 06:00:23.885000+07:00,2024-08-08 06:00:23.885000+07:00

In [10]:
# insert data to funds table
insert_dataframe_to_sql("top_asset_holdings", df_top_asset)

Connecting to SQL Server database....
connection successful.
Data inserted into top_asset_holdings successfully.

## 5. Danh sách top nắm giữ theo nhóm ngành

In [11]:
top_industry = []
for fund_id in list_fund_id:
    top_industry.append(get_industry_holding(fund_id))

# flatten list top hoding
top_industry = [industry for fund in top_industry for industry in fund]

In [12]:
df_top_industry = pd.DataFrame(top_industry)

# rename column cammel format to snake
df_top_industry.columns = [camel_to_snake(col) for col in df_top_industry.columns]

# create unique id value
df_top_industry["fund_index"] = df_top_industry.groupby("fund_id").cumcount() + 1

df_top_industry["id"] = df_top_industry.apply(
    lambda x: str(x["fund_id"]) + "_" + str(x["fund_index"]), axis=1
)

df_top_industry = df_top_industry[["id", "fund_id", "industry", "asset_percent"]]

# handle missing or NaN value
df_top_industry = convert_numeric_nan_to_none(df_top_industry)

df_top_industry.head(5)

     id  fund_id                industry  asset_percent
0  68_1       68               Ngân hàng          37.11
1  68_2       68  Công nghệ và thông tin          17.86
2  68_3       68                Xây dựng           6.33
3  68_4       68       Vận tải - Kho bãi           5.50
4  68_5       68                Bảo hiểm           4.56

In [13]:
# insert data to funds table
insert_dataframe_to_sql("top_industry_holdings", df_top_industry)

Connecting to SQL Server database....
connection successful.
Data inserted into top_industry_holdings successfully.

## 6. Net asset value

In [37]:
start_date = date.today().strftime("%Y%m%d")
print(start_date)

20240901

In [49]:
list_nav = []
for fund_id in list_fund_id:
    list_nav.append(get_nav_history(fund_id))

In [50]:
# flatten list top hoding
list_nav = [nav for fund in list_nav for nav in fund]

df_nav = pd.DataFrame(list_nav)

df_nav.head()

      id  createdAt       nav     navDate  productId
0  21001        NaN   9996.94  2023-05-09         68
1  20963        NaN  10000.00  2023-05-11         68
2  20964        NaN  10085.36  2023-05-31         68
3  20965        NaN  10041.77  2023-06-01         68
4  20966        NaN  10084.79  2023-06-02         68

In [51]:
df_nav.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29274 entries, 0 to 29273
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         29274 non-null  int64
 1   createdAt  17807 non-null  float64
 2   nav        29274 non-null  float64
 3   navDate    29274 non-null  object
 4   productId  29274 non-null  int64
dtypes: float64(2), int64(2), object(1)
memory usage: 1.1+ MB

In [52]:
df_nav.loc[df_nav.id == 5237, "navDate"] = "2020-11-11"

In [53]:
df_nav["navDate"] = pd.to_datetime(df_nav["navDate"])
df_nav["createdAt"] = df_nav["createdAt"].apply(
    lambda x: None if pd.isna(x) else unix_to_datetime_with_timezone(x)
)

# rename column cammel format to snake
df_nav.columns = [camel_to_snake(col) for col in df_nav.columns]

df_nav = df_nav[["id", "product_id", "nav_date", "nav", "created_at"]]

df_nav["created_at"] = df_nav["created_at"].astype(object)
# handle missing or NaN value
df_nav = convert_numeric_nan_to_none(df_nav)

df_nav.tail()

,id,product_id,nav_date,nav,created_at
29269,29297,69,2024-08-26,10618.25,2024-08-26 17:20:59.766000+07:00
29270,30011,69,2024-08-27,10514.18,2024-08-27 16:37:29.201000+07:00
29271,30049,69,2024-08-28,10491.88,2024-08-28 17:14:33.965000+07:00
29272,30082,69,2024-08-29,10495.25,2024-08-29 16:48:23.026000+07:00
29273,30120,69,2024-08-30,10503.55,2024-08-30 16:52:37.511000+07:00

In [54]:
insert_dataframe_to_sql("net_asset_values", df_nav)

Connecting to SQL Server database....
connection successful.
Data inserted into net_asset_values successfully.